pwbf/RX64M_THULake/src/main.c
uint8_t rtnSend = 0;
uint8_t RecValue[1] = {0};
uint8_t rtnData[13];
uint8_t *pValue = &RecValue;
int rtnRecieve;
void LORA_Recieve(uint8_t status);

void LoRaJoin(){
	printf("Send: mac join abp\n");
	rtnSend = R_SCI_Send(g_my_sci_handle_ch1,"mac join abp",12);
	delay1s(1000);
	LORA_Recieve(rtnSend);
}


void LORA_Recieve(uint8_t status){
	*pValue = &RecValue;
	printf("Send Status=0x%02X\n",status);
	printf("Return:\n");
	while(rtnSend == SCI_SUCCESS){
		rtnRecieve = R_SCI_Receive(g_my_sci_handle_ch1,pValue,1);
		if(rtnRecieve == SCI_SUCCESS){
			printf("%c",RecValue[0]);
		}
		else{
			//printf("Receive Status=0x%02X\n",rtnRecieve);
			break;
		}
	}	
}

uint8_t sensorSend(){
	uint8_t cmd[8];
	sprintf(cmd,"%c%c%c%c%c%c%c%c",SENS_ADDR,SENS_FUNC_READ,SENS_REG_READ_STARTH,SENS_REG_READ_STARTL,SENS_REG_COUNTH,SENS_REG_COUNTL,0x40,0x08);
	R_SCI_Send(g_my_sci_handle_ch2,cmd,HOST_SEND_LENGTH);
	return 0;
}

void sensorRead(uint8_t status){
	*pValue = &RecValue;
	printf("Send Status=0x%02X\n",status);
	printf("Return:\n");
	int i = 0;
	while(status == SCI_SUCCESS){
		rtnRecieve = R_SCI_Receive(g_my_sci_handle_ch2,pValue,1);
		if(rtnRecieve == SCI_SUCCESS){
			rtnData[i++] = RecValue[0];
			// printf("0X%2x",RecValue[0]);
		}
		else{
			printf("Receive Status=0x%02X\n",rtnRecieve);
			break;
		}
		R_BSP_SoftwareDelay (100, BSP_DELAY_MILLISECS);
	}	
}

		
void main(void){
	PORTE.PDR.BIT.B1=1;
	
	Rx64MInitPorts();
	UARTInit();
	ADCInit();		
	ADCStart();
	LoRaJoin();
	
	LED1=LED_OFF;
	
	//ShowSCIErrorCode();
	uint8_t cmd[8];
	sprintf(cmd,"%c%c%c%c%c%c%c%c",SENS_ADDR,SENS_FUNC_READ,SENS_REG_READ_STARTH,SENS_REG_READ_STARTL,SENS_REG_COUNTH,SENS_REG_COUNTL,0x40,0x08);
	R_SCI_Send(g_my_sci_handle_ch2,cmd,HOST_SEND_LENGTH);
	
    while (1){
		LED1=LED_ON;
		
		sensorRead(0);
		printf("Send: mac tx ucnf 2 FA\n");
		rtnSend = R_SCI_Send(g_my_sci_handle_ch1,"mac tx ucnf 2 FA",16);
		delay1s(1000);
		LORA_Recieve(rtnSend);
		// RES3=LED_OFF;
        // R_BSP_SoftwareDelay (1, BSP_DELAY_SECS);
		// rtnSend = sensorSend();
		// RES3=LED_ON;
        // R_BSP_SoftwareDelay (2, BSP_DELAY_SECS);
		// delay1s(1000);
		// rtnSend = sensorSend(0x04);
		// sensorRead(rtnSend);
		
		printf("\n\nEnded\n");

		LED1=LED_OFF;
		R_BSP_SoftwareDelay (100, BSP_DELAY_MILLISECS);
		break;
	}
}

/*****************************************************************************/
/*Functions for . Begin*/
/*****************************************************************************/

// uint16_t HLbyte(uint8_t HIGH, uint8_t LOW){
	// uint16_t
	// return 0;
// }

void U16toStr(uint16_t value, uint8_t *buff){
 uint8_t i;
 uint8_t j;
 int8_t temp;

 if (value == 0)
 {
  buff[0] = '0';
  buff[1] = 0;
  return;
 }

 i = 0;
 while (value)
 {
  buff[i] = HexChar[value % 10];
  value /= 10;
  i++;
 }

 buff[i] = 0;

 for (j = 0; j < (i / 2); j++)
 {
  temp = buff[j];
  buff[j] = buff[i - j -1];
  buff[i - j -1] = temp;
 }
}

void delay1s(unsigned int tmp){
    unsigned int i,j;
    i=tmp;
    while(i--){
        j=80404;
        while(j--);
    }
}



/*****************************************************************************
* Function Name: ADCStart
* Description  :
* Arguments   :
* Return Value : none
******************************************************************************/
static void ADCStart(void){
        adc_err_t       adc_err;

        /* Initialize trigger source (MTU0) */
        init_mtu0();

        /* Enable triggers in ADC */   /*Enables to start A/D conversion with TRIG, */
        adc_err = R_ADC_Control(0, ADC_CMD_ENABLE_TRIG, FIT_NO_PTR);
        while (ADC_SUCCESS != adc_err)
        {
        /* Error - loop here for debug */
        }

}


/*****************************************************************************
* Function Name: ADCInit
* Description  :
* Arguments   :
* Return Value : none
******************************************************************************/
static void ADCInit(void){
        adc_err_t       adc_err;
        adc_err_t       adc_err0;
        adc_err_t       adc_err1;
        adc_err_t       adc_err2;
        adc_err_t       adc_err3;
        adc_cfg_t       config;     // Open() configuration
        adc_ch_cfg_t    ch_cfg;     // Control() channel configuration

        /* Clear all members of the adc_cfg_t structure */
        memset(&config, 0, sizeof(config));
        config.resolution =  ADC_RESOLUTION_12_BIT;     // 12 bit resolution
        config.alignment = ADC_ALIGN_RIGHT;             // conversions are right-aligned
        config.add_cnt = ADC_ADD_OFF;                   // no addition on conversions
        config.clearing = ADC_CLEAR_AFTER_READ_OFF;     // data remains in register after reading
        config.trigger = ADC_TRIG_SYNC_TRG0AN;          // trigger from mtu
        config.trigger_groupb = ADC_TRIG_NONE;          // group mode not used
        config.priority = 3;                            // interrupt priority 3 (1=low, 15=high)
        config.priority_groupb = 0;                     // group mode not used

        // adc_err = R_ADC_Open(0, ADC_MODE_SS_ONE_CH, &config, MyCallback);
        // adc_err = R_ADC_Open(0, ADC_MODE_SS_MULTI_CH, &config, MyCallback);
        adc_err = R_ADC_Open(0, ADC_MODE_SS_MULTI_CH, &config, MyCallback);
        while (ADC_SUCCESS != adc_err)
        {
            /* Error - loop here for debug */
        }

        /* Enable channel */
				                    
		// ch_cfg.chan_mask = ADC_MASK_CH4;                     
		ch_cfg.chan_mask = ADC_MASK_CH0|ADC_MASK_CH1|ADC_MASK_CH2|ADC_MASK_CH3; 
		// ch_cfg.chan_mask = ADC_MASK_CH0; 
		// select channel 0 1 2 3 (POT) (PDF r01an1666ej0301-rx p48)
        ch_cfg.priority_groupa = ADC_GRPA_PRIORITY_OFF;      // group mode not used
        ch_cfg.chan_mask_groupb = ADC_MASK_GROUPB_OFF;       // group mode not used
        ch_cfg.add_mask = ADC_MASK_ADD_OFF;                  // no channels using addition
        ch_cfg.diag_method = ADC_DIAG_OFF;                   // self-diagnosis off
        ch_cfg.anex_enable = false;                          // no external amplifier
        ch_cfg.sample_hold_mask = ADC_MASK_SAMPLE_HOLD_OFF;  // Bypass chnl-dedicated S&H circuits
        ch_cfg.sample_hold_states = ADC_SST_SH_CNT_DEFAULT;  // default sample & hold states

        adc_err = R_ADC_Control(0, ADC_CMD_ENABLE_CHANS, &ch_cfg);
        while (ADC_SUCCESS != adc_err){
        /* Error - loop here for debug */
			printf("Hi");
        }
		
