pwbf/RX64M_THULake/src/main.c
		/*Use channel 1 & 2*/
		my_sci_err_ch1 = R_SCI_Open(SCI_CH1, SCI_MODE_ASYNC, &my_sci_config, my_sci_callback_ch1, &g_my_sci_handle_ch1);
		my_sci_err_ch2 = R_SCI_Open(SCI_CH2, SCI_MODE_ASYNC, &my_sci_config, my_sci_callback_ch2, &g_my_sci_handle_ch2);

        /* If there were an error this would demonstrate error detection of API calls. */
        if (SCI_SUCCESS != my_sci_err_ch1)
        {
			printf("SCI_Open_Ch1_Error!!\n");
        }
		
		if (SCI_SUCCESS != my_sci_err_ch2)
        {
			printf("SCI_Open_Ch2_Error!!\n");
        }
}

/*****************************************************************************
* Function Name: my_sci_callback
* Description  : This is a template for an SCI Async Mode callback function.
* Arguments    : pArgs -
*                    pointer to sci_cb_args_t structure cast to a void. Structure
*                    contains event and associated data.
* Return Value : none
******************************************************************************/
void my_sci_callback_ch2(void *pArgs){
	sci_cb_args_t   *args;

    args = (sci_cb_args_t *)pArgs;

    if (args->event == SCI_EVT_RX_CHAR)
    {
        /* From RXI interrupt; received character data is in args->byte */
        LED0 = ~LED0;         // Toggle LED to demonstrate callback execution.
        nop();
    }
    else if (args->event == SCI_EVT_RXBUF_OVFL)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in args->byte
           You will need to increase buffer size or reduce baud rate */
        nop();
    }
    else if (args->event == SCI_EVT_OVFL_ERR)
    {
        /* From receiver overflow error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_FRAMING_ERR)
    {
        /* From receiver framing error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_PARITY_ERR)
    {
        /* From receiver parity error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
}

void my_sci_callback_ch1(void *pArgs){
	sci_cb_args_t   *args;

    args = (sci_cb_args_t *)pArgs;

    if (args->event == SCI_EVT_RX_CHAR)
    {
        /* From RXI interrupt; received character data is in args->byte */
        LED0 = ~LED0;         // Toggle LED to demonstrate callback execution.
        nop();
    }
    else if (args->event == SCI_EVT_RXBUF_OVFL)
    {
        /* From RXI interrupt; rx queue is full; 'lost' data is in args->byte
           You will need to increase buffer size or reduce baud rate */
        nop();
    }
    else if (args->event == SCI_EVT_OVFL_ERR)
    {
        /* From receiver overflow error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_FRAMING_ERR)
    {
        /* From receiver framing error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
    else if (args->event == SCI_EVT_PARITY_ERR)
    {
        /* From receiver parity error interrupt; error data is in args->byte
           Error condition is cleared in calling interrupt routine */
        nop();
    }
}


/*****************************************************************************/
/*Functions for UART.End*/
/*****************************************************************************/

/*****************************************************************************
* Function Name: sci_rx65N_init_ports
* Description  : This function initializes the port pins associated with SCI
*                channel 2, which is connected to the USB serial port Virtual
*                COM Interface.
* Arguments    : none
* Return Value : none
******************************************************************************/
static void Rx64MInitPorts(void){
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_MPC); // Use BSP function to unlock the MPC register.

	/*Sensor*/
	/*For SCI-UART_ch2*/
        /* Set RXD2 pin */  /*P52*/
        MPC.P52PFS.BYTE = 0x0A;
        PORT5.PMR.BYTE |= 0x04;    // Set P52 mode to peripheral operation
        /* Set TXD2 pin */  /*P50*/
        PORT5.PODR.BYTE |= 0x01;
        MPC.P50PFS.BYTE = 0x0A;
        PORT5.PMR.BYTE |= 0x01;  // Set P50 mode to peripheral operation
        PORT5.PDR.BYTE |= 0x01;	
		
	/*LoRa*/
	/*For SCI-UART_ch1*/ 
        /* Set RXD1 pin */  /*P15*/
        MPC.P15PFS.BYTE = 0x0A;
        PORT1.PMR.BYTE |= 0x20;    // Set P21 mode to peripheral operation

        /* Set TXD1 pin */  /*P26*/
        PORT2.PODR.BYTE |= 0x40;
        MPC.P26PFS.BYTE = 0x0A;
        PORT2.PMR.BYTE |= 0x40;  // Set P26 mode to peripheral operation
        PORT2.PDR.BYTE |= 0x40;


    /*For ADC*/
		
		/*Setting for P40 as AN000*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P40 AN000; POT on
        PORT4.PDR.BIT.B0 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B0 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P41 as AN001*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P41 AN001; POT on
        PORT4.PDR.BIT.B1 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B1 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P42 as AN002*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P42 AN002; POT on
        PORT4.PDR.BIT.B2 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B2 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
		/*Setting for P43 as AN003*/
        MPC.P40PFS.BYTE = 0x80;     // Pin Func Select P43 AN003; POT on
        PORT4.PDR.BIT.B3 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B3 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.

        /*Setting for P44 as AN004*/
        MPC.P44PFS.BYTE = 0x80;     // Pin Func Select P44 AN004; POT on
        PORT4.PDR.BIT.B4 = 0;       // set AN pin direction to input (default)
        PORT4.PMR.BIT.B4 = 1;       // set AN pin mode to peripheral
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_MPC); // Re-lock the MPC register.
		
        return;
}






